In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

In [4]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan' , 'bil_bulat']

df = pd.DataFrame(np.random.randint(1,20, size = (n_rows, n_cols)), columns = cols)
df ['bil_pecahan'] = df['bil_pecahan'].astype('float')

df

   bil_pecahan  bil_bulat
0          8.0         15
1          9.0          2
2          6.0          5
3         11.0         12
4          8.0         12

In [11]:
#df.index = pd.util.testing.makeDateIndex(n_rows, freq='H') 
pd.date_range (start='2023-10-01', periods=n_rows, freq='H')
df = df.reset_index()
df['teks'] = list('ABCDE')

df

   level_0  index  bil_pecahan  bil_bulat teks
0        0      0          8.0         15    A
1        1      1          9.0          2    B
2        2      2          6.0          5    C
3        3      3         11.0         12    D
4        4      4          8.0         12    E